import Appheader from "./subcomponents/Header";
import fizer from "../images/fizer.jpg";
import moderna from "../images/moderna.jpg";
import astar from "../images/astar.jpg";
import sinovac from "../images/sinovac.jpg";
import sinofarm from "../images/sinofarm.jpg";

const DeTailVac = () => {
  return (
    <>
      <Appheader></Appheader>
      <div className="flex flex-col items-center justify-center bg-green-500">
        <div className="bg-white shadow-md rounded px-10 pt-6 pb-8 mb-5 mt-5">
          <h1 className="font-bold text-center text-2xl">ข้อมูลวัคซีน</h1>
          
          <br />
          <h3 className=" text-b">1. วัคซีนไฟเซอร์ (Pfizer)</h3>
          <img
            src={fizer}
            className="center"
            alt="บวก"
            width="500px"
            height="400px"
          />
          <p>
            ชื่อวัคซีน : BNT162b2 เป็นวัคซีนชนิด mRNA <br />
            ผู้พัฒนา : บริษัทไฟเซอร์ (Pfizer) จากสหรัฐอเมริกา
            และบริษัทไบโอเอ็นเทค (BioNTech) ของเยอรมนี <br />
            ต้องฉีดกี่โด๊ส : 2 เข็ม ระยะห่างกัน 21 วัน
            <br />
            ราคาวัคซีนโควิด Pfizer : 19.5 ดอลลาร์สหรัฐ/โด๊ส (ประมาณ 590
            บาท/โด๊ส)
            <br />
            ประสิทธิภาพ : ป้องกันการติดเชื้อแบบมีอาการ 95% <br />
            อายุของผู้ได้รับวัคซีน : 16 ปีขึ้นไป
            (ยกเว้นที่สหรัฐอเมริกาอนุญาตให้ใช้ในเด็กอายุ 12-15 ปีได้แล้ว)
            <br />
            การเก็บรักษา : ต้องเก็บในอุณหภูมิต่ำกว่า -70 ºC ทำให้ยากต่อการขนส่ง
            ขณะที่หากเก็บในอุณหภูมิ 2-8 องศาเซลเซียส จะสามารถเก็บได้ 120 ชั่วโมง
            (5 วัน) <br />
            ประเทศที่ใช้วัคซีน Pfizer : เช่น สหรัฐอเมริกา แคนาดา อังกฤษ นอร์เวย์
            เซอร์เบีย สวิตเซอร์แลนด์ สหรัฐอาหรับเอมิเรตส์ ซาอุดีอาระเบีย
            อิสราเอล
            <br />
          </p>
          <br />
          
          <h3>2. วัคซีนโมเดอร์นา (Moderna)</h3>
          <img
            src={moderna}
            className="center"
            alt="บวก"
            width="500px"
            height="400px"
          />
          <p>
            ชื่อวัคซีน : mRNA-1273 เป็นวัคซีนชนิด mRNA เหมือนของไฟเซอร์
            <br />
            ผู้พัฒนา : บริษัทโมเดอร์นา (Moderna) ประเทศสหรัฐอเมริกา
            <br />
            ต้องฉีดกี่โด๊ส : 2 เข็ม ระยะห่างกัน 28 วัน
            <br />
            ราคาวัคซีน Moderna : 25-37 ดอลลาร์สหรัฐ/โด๊ส (ประมาณ 757-1,120
            บาท/โด๊ส)
            <br />
            ประสิทธิภาพ : โดยรวม 94.5%, ป้องกันอาการรุนแรง 100%
            <br />
            อายุของผู้ได้รับวัคซีน : 18 ปีขึ้นไป
            <br />
            การเก็บรักษา : เก็บในอุณหภูมิต่ำกว่า -20 ºC
            ซึ่งเป็นอุณหภูมิในช่องแข็งตู้เย็นปกติ
            แต่ก็สามารถเก็บในอุณหภูมิตู้เย็น 2-8 ºC ได้ 30 วัน
            <br />
            ประเทศที่ใช้วัคซีน Moderna : เช่น สหรัฐอเมริกา แคนาดา กาตาร์
            สิงคโปร์ เวียดนาม ไอซ์แลนด์ นอร์เวย์
            <br />
          </p>
          <br />
          <h3>3. วัคซีนแอสตราเซเนกา (AstraZeneca)</h3>
          <img
            src={astar}
            className="center"
            alt="บวก"
            width="500px"
            height="400px"
          />
          <p>
            ชื่อวัคซีน : ChAdOx1 nCoV-19 vaccine (AZD1222)
            เป็นวัคซีนชนิดไวรัสเวกเตอร์ที่แบ่งตัวไม่ได้
            <br />
            ผู้พัฒนา : มหาวิทยาลัยออกซฟอร์ด (Oxford University)
            ร่วมกับบริษัทแอสตราเซเนกา (AstraZeneca) <br />
            ต้องฉีดกี่โด๊ส : 2 เข็ม ระยะห่างกัน 4-12 สัปดาห์ (แต่มีการศึกษาพบว่า
            วัคซีนจะมีประสิทธิภาพมากขึ้นเมื่อฉีดห่างกัน 8 สัปดาห์ขึ้นไป
            <br />
            องค์การอนามัยโลกจึงแนะนำให้ฉีดห่างกัน 8-12 สัปดาห์)
            ราคาวัคซีน AstraZeneca : 2.16-5.25 ดอลลาร์สหรัฐ/โด๊ส (ประมาณ 66-160
            บาท/โด๊ส)
            <br />
            ประสิทธิภาพ : โดยรวม 70.4%, ป้องกันอาการรุนแรง 100%
            <br />
            อายุของผู้ได้รับวัคซีน : 18 ปีขึ้นไป <br />
            การเก็บรักษา : สามารถเก็บไว้ได้ในอุณหภูมิตู้เย็น 2-8 ºC <br />
            ประเทศที่ใช้วัคซีน AstraZeneca : เช่น สหราชอาณาจักร บราซิล ไทย
            เวียดนาม ไต้หวัน มาเลเซีย เกาหลีใต้
            <br />
          </p>
          <br />
          <h3>4. วัคซีนซิโนแวค (Sinovac)</h3> <br />
          <img
            src={sinovac}
            className="center"
            alt="บวก"
            width="500px"
            height="400px"
          />
          <p>
            ชื่อวัคซีน : Corona Vac เป็นวัคซีนชนิดเชื้อตาย
            <br />
            ผู้พัฒนา : บริษัท ซิโนแวค ไบโอเทค (Sinovac Biotech) ประเทศจีน
            <br />
            ต้องฉีดกี่โด๊ส : 2 เข็ม ระยะห่างกัน 2-4 สัปดาห์ <br />
            ราคาวัคซีน Sinovac : เนื่องจากเป็นวัคซีนชนิดเชื้อตายที่ผลิตได้ยาก
            จึงมีราคาค่อนข้างสูง อยู่ที่ประมาณ 200 หยวน/โด๊ส (29.75 USD)
            หรือประมาณ 940 บาท <br />โดยประเทศไทยสั่งซื้อวัคซีนลอตแรกจากจีน จำนวน
            192,000 โด๊ส คิดเป็นเงินประมาณ 98 ล้านบาท เท่ากับราคาวัคซีนโด๊สละ
            513 บาท <br />โดยประมาณ 
            ประสิทธิภาพ : ป้องกันการติดเชื้อที่มีอาการ 65.3-91.25%
            (ผลการทดสอบแตกต่างกันในแต่ละประเทศ), ป้องกันอาการรุนแรง 100%
            <br />
            อายุของผู้ได้รับวัคซีน : 18-59 ปี
            ล่าสุดคณะกรรมการควบคุมโรคติดต่อแห่งชาติอนุญาตให้ฉีดในคนอายุ 60
            ปีขึ้นไปได้แล้ว <br />
            การเก็บรักษา : สามารถเก็บไว้ในอุณหภูมิตู้เย็น 2-8 ºC ได้นาน 3 ปี{" "}
            <br />
            ประเทศที่ใช้วัคซีน Sinovac : เช่น จีน ตุรกี ไทย มาเลเซีย ฟิลิปปินส์
            อินโดนีเซีย บราซิล ชิลี
            <br />
          </p>
          <br />
          <h3>5. วัคซีนซิโนฟาร์ม (Sinopharm)</h3>
          <img
            src={sinofarm}
            className="center"
            alt="บวก"
            width="500px"
            height="400px"
          />
          <p>
            ชื่อวัคซีน : BBIBP-CorV เป็นวัคซีนชนิดเชื้อตาย
            <br />
            ผู้พัฒนา : บริษัทซิโนฟาร์ม (Sinopharm) สัญชาติจีน
            <br />
            ต้องฉีดกี่โด๊ส : 2 เข็ม ระยะห่างกัน 21 วัน
            <br />
            ประสิทธิภาพ : โดยรวม 79-86% (ผลการทดสอบแตกต่างกันในแต่ละประเทศ)
            <br />
            อายุของผู้ได้รับวัคซีน : 18 ปีขึ้นไป
            <br />
            การเก็บรักษา : สามารถเก็บไว้ได้ในอุณหภูมิตู้เย็น 2-8 ºC <br />
            ประเทศที่ใช้วัคซีน Sinopharm : เช่น จีน กัมพูชา ลาว โมร็อกโก
            สหรัฐอาหรับเอมิเรตส์ บาห์เรน เซเนกัล
            <br />
          </p>
          <br />
        </div>
      </div>
    </>
  );
};

export default DeTailVac;
